[Survived] StringLiteral
routes/appointments.js:9:5
 
 // POST /api/appointments — book an appointment
 router.post(
-    "/",
+    "",
     [
         body("patient_name").trim().notEmpty().withMessage("Patient name is required"),

[Survived] MethodExpression
routes/appointments.js:11:9
 router.post(
     "/",
     [
-        body("patient_name").trim().notEmpty().withMessage("Patient name is required"),
+        body("patient_name").notEmpty().withMessage("Patient name is required"),
         body("patient_email").isEmail().withMessage("Valid email is required"),
         body("provider_id").isInt().withMessage("Provider ID is required"),

[Survived] StringLiteral
routes/appointments.js:11:60
 router.post(
     "/",
     [
-        body("patient_name").trim().notEmpty().withMessage("Patient name is required"),
+        body("patient_name").trim().notEmpty().withMessage(""),
         body("patient_email").isEmail().withMessage("Valid email is required"),
         body("provider_id").isInt().withMessage("Provider ID is required"),

[Killed] StringLiteral
routes/appointments.js:12:14
     "/",
     [
         body("patient_name").trim().notEmpty().withMessage("Patient name is required"),
-        body("patient_email").isEmail().withMessage("Valid email is required"),
+        body("").isEmail().withMessage("Valid email is required"),
         body("provider_id").isInt().withMessage("Provider ID is required"),
         body("service_id").isInt().withMessage("Service ID is required"),
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] StringLiteral
routes/appointments.js:13:49
     [
         body("patient_name").trim().notEmpty().withMessage("Patient name is required"),
         body("patient_email").isEmail().withMessage("Valid email is required"),
-        body("provider_id").isInt().withMessage("Provider ID is required"),
+        body("provider_id").isInt().withMessage(""),
         body("service_id").isInt().withMessage("Service ID is required"),
         body("slot_id").isInt().withMessage("Slot ID is required"),

[Killed] StringLiteral
routes/appointments.js:14:14
         body("patient_name").trim().notEmpty().withMessage("Patient name is required"),
         body("patient_email").isEmail().withMessage("Valid email is required"),
         body("provider_id").isInt().withMessage("Provider ID is required"),
-        body("service_id").isInt().withMessage("Service ID is required"),
+        body("").isInt().withMessage("Service ID is required"),
         body("slot_id").isInt().withMessage("Slot ID is required"),
         body("notes").optional().trim(),
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] StringLiteral
routes/appointments.js:15:14
         body("patient_email").isEmail().withMessage("Valid email is required"),
         body("provider_id").isInt().withMessage("Provider ID is required"),
         body("service_id").isInt().withMessage("Service ID is required"),
-        body("slot_id").isInt().withMessage("Slot ID is required"),
+        body("").isInt().withMessage("Slot ID is required"),
         body("notes").optional().trim(),
     ],
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] MethodExpression
routes/appointments.js:16:9
         body("provider_id").isInt().withMessage("Provider ID is required"),
         body("service_id").isInt().withMessage("Service ID is required"),
         body("slot_id").isInt().withMessage("Slot ID is required"),
-        body("notes").optional().trim(),
+        body("notes").optional(),
     ],
     (req, res, next) => {

[Killed] StringLiteral
routes/appointments.js:16:14
         body("provider_id").isInt().withMessage("Provider ID is required"),
         body("service_id").isInt().withMessage("Service ID is required"),
         body("slot_id").isInt().withMessage("Slot ID is required"),
-        body("notes").optional().trim(),
+        body("").optional().trim(),
     ],
     (req, res, next) => {
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] ConditionalExpression
routes/appointments.js:20:13
     ],
     (req, res, next) => {
         const errors = validationResult(req);
-        if (!errors.isEmpty()) {
+        if (false) {
             return res.status(400).json({ errors: errors.array() });
         }
killedBy: Appointments API POST /api/appointments returns 400 when required fields are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] ConditionalExpression
routes/appointments.js:20:13
     ],
     (req, res, next) => {
         const errors = validationResult(req);
-        if (!errors.isEmpty()) {
+        if (true) {
             return res.status(400).json({ errors: errors.array() });
         }
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ObjectLiteral
routes/appointments.js:21:41
     (req, res, next) => {
         const errors = validationResult(req);
         if (!errors.isEmpty()) {
-            return res.status(400).json({ errors: errors.array() });
+            return res.status(400).json({});
         }
 
killedBy: Appointments API POST /api/appointments returns 400 when required fields are missing
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "errors"
Received path: []

Received value: {}

[Killed] ConditionalExpression
routes/appointments.js:29:17
 
             // Verify slot exists and is available
             const slot = db.prepare("SELECT * FROM time_slots WHERE id = ?").get(slot_id);
-            if (!slot) {
+            if (true) {
                 const err = new Error("Time slot not found");
                 err.status = 404;
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] ConditionalExpression
routes/appointments.js:29:17
 
             // Verify slot exists and is available
             const slot = db.prepare("SELECT * FROM time_slots WHERE id = ?").get(slot_id);
-            if (!slot) {
+            if (false) {
                 const err = new Error("Time slot not found");
                 err.status = 404;
killedBy: Appointments API POST /api/appointments returns 404 for a non-existent slot
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Survived] StringLiteral
routes/appointments.js:30:39
             // Verify slot exists and is available
             const slot = db.prepare("SELECT * FROM time_slots WHERE id = ?").get(slot_id);
             if (!slot) {
-                const err = new Error("Time slot not found");
+                const err = new Error("");
                 err.status = 404;
                 return next(err);

[Killed] BooleanLiteral
routes/appointments.js:34:17
                 err.status = 404;
                 return next(err);
             }
-            if (!slot.is_available) {
+            if (slot.is_available) {
                 const err = new Error("Time slot is no longer available");
                 err.status = 409;
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 409

[Killed] ConditionalExpression
routes/appointments.js:34:17
                 err.status = 404;
                 return next(err);
             }
-            if (!slot.is_available) {
+            if (true) {
                 const err = new Error("Time slot is no longer available");
                 err.status = 409;
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 409

[Killed] BlockStatement
routes/appointments.js:41:47
             }
 
             // Book the appointment within a transaction
-            const book = db.transaction(() => {
-                // Mark slot as unavailable
-                db.prepare("UPDATE time_slots SET is_available = 0 WHERE id = ?").run(slot_id);
-
-                // Create appointment
-                const result = db
-                    .prepare(
-                        `INSERT INTO appointments (patient_name, patient_email, provider_id, service_id, slot_id, notes)
-             VALUES (?, ?, ?, ?, ?, ?)`
-                    )
-                    .run(patient_name, patient_email, provider_id, service_id, slot_id, notes || null);
-
-                return db
-                    .prepare(
-                        `SELECT a.*, p.name as provider_name, p.specialty, s.name as service_name,
-                    s.duration_minutes, s.price, t.date, t.start_time, t.end_time
-             FROM appointments a
-             JOIN providers p ON a.provider_id = p.id
-             JOIN services s ON a.service_id = s.id
-             JOIN time_slots t ON a.slot_id = t.id
-             WHERE a.id = ?`
-                    )
-                    .get(result.lastInsertRowid);
-            });
+            const book = db.transaction(() => {});
 
             const appointment = book();
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "id"
Received path: []

Received value: ""

[Killed] StringLiteral
routes/appointments.js:48:25
                 // Create appointment
                 const result = db
                     .prepare(
-                        `INSERT INTO appointments (patient_name, patient_email, provider_id, service_id, slot_id, notes)
-             VALUES (?, ?, ?, ?, ?, ?)`
+                        ``
                     )
                     .run(patient_name, patient_email, provider_id, service_id, slot_id, notes || null);
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
routes/appointments.js:51:89
                         `INSERT INTO appointments (patient_name, patient_email, provider_id, service_id, slot_id, notes)
              VALUES (?, ?, ?, ?, ?, ?)`
                     )
-                    .run(patient_name, patient_email, provider_id, service_id, slot_id, notes || null);
+                    .run(patient_name, patient_email, provider_id, service_id, slot_id, false);
 
                 return db
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
routes/appointments.js:51:89
                         `INSERT INTO appointments (patient_name, patient_email, provider_id, service_id, slot_id, notes)
              VALUES (?, ?, ?, ?, ?, ?)`
                     )
-                    .run(patient_name, patient_email, provider_id, service_id, slot_id, notes || null);
+                    .run(patient_name, patient_email, provider_id, service_id, slot_id, true);
 
                 return db
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] StringLiteral
routes/appointments.js:55:25
 
                 return db
                     .prepare(
-                        `SELECT a.*, p.name as provider_name, p.specialty, s.name as service_name,
-                    s.duration_minutes, s.price, t.date, t.start_time, t.end_time
-             FROM appointments a
-             JOIN providers p ON a.provider_id = p.id
-             JOIN services s ON a.service_id = s.id
-             JOIN time_slots t ON a.slot_id = t.id
-             WHERE a.id = ?`
+                        ``
                     )
                     .get(result.lastInsertRowid);
killedBy: Appointments API POST /api/appointments books a valid appointment and returns 201
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[NoCoverage] BlockStatement
routes/appointments.js:68:23
 
             const appointment = book();
             res.status(201).json(appointment);
-        } catch (err) {
-            if (err.message.includes("UNIQUE constraint")) {
-                const error = new Error("This time slot is already booked");
-                error.status = 409;
-                return next(error);
-            }
-            next(err);
-        }
+        } catch (err) {}
     }
 );

[NoCoverage] ConditionalExpression
routes/appointments.js:69:17
             const appointment = book();
             res.status(201).json(appointment);
         } catch (err) {
-            if (err.message.includes("UNIQUE constraint")) {
+            if (false) {
                 const error = new Error("This time slot is already booked");
                 error.status = 409;

[NoCoverage] BlockStatement
routes/appointments.js:69:60
             const appointment = book();
             res.status(201).json(appointment);
         } catch (err) {
-            if (err.message.includes("UNIQUE constraint")) {
-                const error = new Error("This time slot is already booked");
-                error.status = 409;
-                return next(error);
-            }
+            if (err.message.includes("UNIQUE constraint")) {}
             next(err);
         }

[NoCoverage] StringLiteral
routes/appointments.js:70:41
             res.status(201).json(appointment);
         } catch (err) {
             if (err.message.includes("UNIQUE constraint")) {
-                const error = new Error("This time slot is already booked");
+                const error = new Error("");
                 error.status = 409;
                 return next(error);

[Survived] StringLiteral
routes/appointments.js:81:5
 
 // GET /api/appointments?email=... — list appointments for a patient
 router.get(
-    "/",
+    "",
     [query("email").isEmail().withMessage("Valid email is required")],
     (req, res) => {

[Killed] StringLiteral
routes/appointments.js:82:12
 // GET /api/appointments?email=... — list appointments for a patient
 router.get(
     "/",
-    [query("email").isEmail().withMessage("Valid email is required")],
+    [query("").isEmail().withMessage("Valid email is required")],
     (req, res) => {
         const errors = validationResult(req);
killedBy: Appointments API GET /api/appointments returns appointments for a valid email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
routes/appointments.js:83:19
 router.get(
     "/",
     [query("email").isEmail().withMessage("Valid email is required")],
-    (req, res) => {
-        const errors = validationResult(req);
-        if (!errors.isEmpty()) {
-            return res.status(400).json({ errors: errors.array() });
-        }
-
-        const appointments = db
-            .prepare(
-                `SELECT a.*, p.name as provider_name, p.specialty, s.name as service_name,
-                s.duration_minutes, s.price, t.date, t.start_time, t.end_time
-         FROM appointments a
-         JOIN providers p ON a.provider_id = p.id
-         JOIN services s ON a.service_id = s.id
-         JOIN time_slots t ON a.slot_id = t.id
-         WHERE a.patient_email = ?
-         ORDER BY t.date DESC, t.start_time DESC`
-            )
-            .all(req.query.email);
-
-        res.json(appointments);
-    }
+    (req, res) => {}
 );
 
killedBy: Appointments API GET /api/appointments returns appointments for a valid email
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
routes/appointments.js:85:32
     [query("email").isEmail().withMessage("Valid email is required")],
     (req, res) => {
         const errors = validationResult(req);
-        if (!errors.isEmpty()) {
-            return res.status(400).json({ errors: errors.array() });
-        }
+        if (!errors.isEmpty()) {}
 
         const appointments = db
killedBy: Appointments API GET /api/appointments returns 400 for an invalid email query param
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
routes/appointments.js:107:14
 );
 
 // PATCH /api/appointments/:id/cancel — cancel an appointment
-router.patch("/:id/cancel", (req, res, next) => {
+router.patch("", (req, res, next) => {
     const appointment = db.prepare("SELECT * FROM appointments WHERE id = ?").get(req.params.id);
 
killedBy: Appointments API PATCH /api/appointments/:id/cancel cancels an existing appointment and returns updated record
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] StringLiteral
routes/appointments.js:111:31
     const appointment = db.prepare("SELECT * FROM appointments WHERE id = ?").get(req.params.id);
 
     if (!appointment) {
-        const err = new Error("Appointment not found");
+        const err = new Error("");
         err.status = 404;
         return next(err);

[Killed] ConditionalExpression
routes/appointments.js:116:9
         return next(err);
     }
 
-    if (appointment.status === "cancelled") {
+    if (true) {
         const err = new Error("Appointment is already cancelled");
         err.status = 400;
killedBy: Appointments API PATCH /api/appointments/:id/cancel cancels an existing appointment and returns updated record
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
routes/appointments.js:116:9
         return next(err);
     }
 
-    if (appointment.status === "cancelled") {
+    if (appointment.status !== "cancelled") {
         const err = new Error("Appointment is already cancelled");
         err.status = 400;
killedBy: Appointments API PATCH /api/appointments/:id/cancel cancels an existing appointment and returns updated record
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
routes/appointments.js:122:41
         return next(err);
     }
 
-    const cancel = db.transaction(() => {
-        db.prepare("UPDATE appointments SET status = 'cancelled' WHERE id = ?").run(req.params.id);
-        db.prepare("UPDATE time_slots SET is_available = 1 WHERE id = ?").run(appointment.slot_id);
-
-        return db
-            .prepare(
-                `SELECT a.*, p.name as provider_name, p.specialty, s.name as service_name,
-                s.duration_minutes, s.price, t.date, t.start_time, t.end_time
-         FROM appointments a
-         JOIN providers p ON a.provider_id = p.id
-         JOIN services s ON a.service_id = s.id
-         JOIN time_slots t ON a.slot_id = t.id
-         WHERE a.id = ?`
-            )
-            .get(req.params.id);
-    });
+    const cancel = db.transaction(() => {});
 
     const updated = cancel();
killedBy: Appointments API PATCH /api/appointments/:id/cancel cancels an existing appointment and returns updated record
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cancelled"
Received: undefined

[Killed] StringLiteral
routes/appointments.js:123:20
     }
 
     const cancel = db.transaction(() => {
-        db.prepare("UPDATE appointments SET status = 'cancelled' WHERE id = ?").run(req.params.id);
+        db.prepare("").run(req.params.id);
         db.prepare("UPDATE time_slots SET is_available = 1 WHERE id = ?").run(appointment.slot_id);
 
killedBy: Appointments API PATCH /api/appointments/:id/cancel cancels an existing appointment and returns updated record
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] StringLiteral
routes/appointments.js:145:5
 
 // PATCH /api/appointments/:id/reschedule — reschedule to a new slot
 router.patch(
-    "/:id/reschedule",
+    "",
     [body("new_slot_id").isInt().withMessage("New slot ID is required")],
     (req, res, next) => {

[NoCoverage] BooleanLiteral
routes/appointments.js:149:13
     [body("new_slot_id").isInt().withMessage("New slot ID is required")],
     (req, res, next) => {
         const errors = validationResult(req);
-        if (!errors.isEmpty()) {
+        if (errors.isEmpty()) {
             return res.status(400).json({ errors: errors.array() });
         }

[NoCoverage] StringLiteral
routes/appointments.js:153:40
             return res.status(400).json({ errors: errors.array() });
         }
 
-        const appointment = db.prepare("SELECT * FROM appointments WHERE id = ?").get(req.params.id);
+        const appointment = db.prepare("").get(req.params.id);
         if (!appointment) {
             const err = new Error("Appointment not found");

[NoCoverage] BlockStatement
routes/appointments.js:154:27
         }
 
         const appointment = db.prepare("SELECT * FROM appointments WHERE id = ?").get(req.params.id);
-        if (!appointment) {
-            const err = new Error("Appointment not found");
-            err.status = 404;
-            return next(err);
-        }
+        if (!appointment) {}
         if (appointment.status === "cancelled") {
             const err = new Error("Cannot reschedule a cancelled appointment");

[NoCoverage] BooleanLiteral
routes/appointments.js:154:13
         }
 
         const appointment = db.prepare("SELECT * FROM appointments WHERE id = ?").get(req.params.id);
-        if (!appointment) {
+        if (appointment) {
             const err = new Error("Appointment not found");
             err.status = 404;

[NoCoverage] ConditionalExpression
routes/appointments.js:159:13
             err.status = 404;
             return next(err);
         }
-        if (appointment.status === "cancelled") {
+        if (true) {
             const err = new Error("Cannot reschedule a cancelled appointment");
             err.status = 400;

[NoCoverage] ConditionalExpression
routes/appointments.js:159:13
             err.status = 404;
             return next(err);
         }
-        if (appointment.status === "cancelled") {
+        if (false) {
             const err = new Error("Cannot reschedule a cancelled appointment");
             err.status = 400;

[NoCoverage] StringLiteral
routes/appointments.js:166:36
         }
 
         const { new_slot_id } = req.body;
-        const newSlot = db.prepare("SELECT * FROM time_slots WHERE id = ?").get(new_slot_id);
+        const newSlot = db.prepare("").get(new_slot_id);
         if (!newSlot) {
             const err = new Error("New time slot not found");

[NoCoverage] ConditionalExpression
routes/appointments.js:167:13
 
         const { new_slot_id } = req.body;
         const newSlot = db.prepare("SELECT * FROM time_slots WHERE id = ?").get(new_slot_id);
-        if (!newSlot) {
+        if (false) {
             const err = new Error("New time slot not found");
             err.status = 404;

[NoCoverage] BlockStatement
routes/appointments.js:167:23
 
         const { new_slot_id } = req.body;
         const newSlot = db.prepare("SELECT * FROM time_slots WHERE id = ?").get(new_slot_id);
-        if (!newSlot) {
-            const err = new Error("New time slot not found");
-            err.status = 404;
-            return next(err);
-        }
+        if (!newSlot) {}
         if (!newSlot.is_available) {
             const err = new Error("New time slot is not available");

[NoCoverage] ConditionalExpression
routes/appointments.js:172:13
             err.status = 404;
             return next(err);
         }
-        if (!newSlot.is_available) {
+        if (false) {
             const err = new Error("New time slot is not available");
             err.status = 409;

[NoCoverage] ConditionalExpression
routes/appointments.js:172:13
             err.status = 404;
             return next(err);
         }
-        if (!newSlot.is_available) {
+        if (true) {
             const err = new Error("New time slot is not available");
             err.status = 409;

[NoCoverage] BlockStatement
routes/appointments.js:178:49
             return next(err);
         }
 
-        const reschedule = db.transaction(() => {
-            // Free old slot
-            db.prepare("UPDATE time_slots SET is_available = 1 WHERE id = ?").run(appointment.slot_id);
-            // Reserve new slot
-            db.prepare("UPDATE time_slots SET is_available = 0 WHERE id = ?").run(new_slot_id);
-            // Update appointment
-            db.prepare("UPDATE appointments SET slot_id = ? WHERE id = ?").run(new_slot_id, req.params.id);
-
-            return db
-                .prepare(
-                    `SELECT a.*, p.name as provider_name, p.specialty, s.name as service_name,
-                  s.duration_minutes, s.price, t.date, t.start_time, t.end_time
-           FROM appointments a
-           JOIN providers p ON a.provider_id = p.id
-           JOIN services s ON a.service_id = s.id
-           JOIN time_slots t ON a.slot_id = t.id
-           WHERE a.id = ?`
-                )
-                .get(req.params.id);
-        });
+        const reschedule = db.transaction(() => {});
 
         const result = reschedule();

[NoCoverage] StringLiteral
routes/appointments.js:180:24
 
         const reschedule = db.transaction(() => {
             // Free old slot
-            db.prepare("UPDATE time_slots SET is_available = 1 WHERE id = ?").run(appointment.slot_id);
+            db.prepare("").run(appointment.slot_id);
             // Reserve new slot
             db.prepare("UPDATE time_slots SET is_available = 0 WHERE id = ?").run(new_slot_id);

[Survived] StringLiteral
routes/appointments.js:205:12
 );
 
 // GET /api/appointments/provider/:providerId — provider schedule (issues #12, #13)
-router.get("/provider/:providerId", (req, res) => {
+router.get("", (req, res) => {
     const { date } = req.query;
     const todayStr = new Date().toISOString().split("T")[0];

[NoCoverage] StringLiteral
routes/appointments.js:209:15
     const { date } = req.query;
     const todayStr = new Date().toISOString().split("T")[0];
 
-    let sql = `SELECT a.*, p.name as provider_name, p.specialty, s.name as service_name,
-                      s.duration_minutes, s.price, t.date, t.start_time, t.end_time
-               FROM appointments a
-               JOIN providers p ON a.provider_id = p.id
-               JOIN services s ON a.service_id = s.id
-               JOIN time_slots t ON a.slot_id = t.id
-               WHERE a.provider_id = ? AND a.status = 'confirmed'`;
+    let sql = ``;
     const params = [req.params.providerId];
 

[NoCoverage] ConditionalExpression
routes/appointments.js:218:9
                WHERE a.provider_id = ? AND a.status = 'confirmed'`;
     const params = [req.params.providerId];
 
-    if (date) {
+    if (true) {
         sql += " AND t.date = ?";
         params.push(date);

[NoCoverage] BlockStatement
routes/appointments.js:218:15
                WHERE a.provider_id = ? AND a.status = 'confirmed'`;
     const params = [req.params.providerId];
 
-    if (date) {
-        sql += " AND t.date = ?";
-        params.push(date);
-    } else {
+    if (date) {} else {
         sql += " AND t.date >= ?";
         params.push(todayStr);

[NoCoverage] BlockStatement
routes/appointments.js:221:12
     if (date) {
         sql += " AND t.date = ?";
         params.push(date);
-    } else {
-        sql += " AND t.date >= ?";
-        params.push(todayStr);
-    }
+    } else {}
 
     sql += " ORDER BY t.date ASC, t.start_time ASC";

[NoCoverage] StringLiteral
routes/appointments.js:222:16
         sql += " AND t.date = ?";
         params.push(date);
     } else {
-        sql += " AND t.date >= ?";
+        sql += "";
         params.push(todayStr);
     }
